Repository: seanpm2001/mt-training-data
Catalog: fuf/fuf_pontoon.tmx
Source language: en_us
Languages: fuf

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
fuf: Keɓe keftinirkon haala ɓurɗe heewde ko eeltaaɗe tawa won leƴrenndooje ena ɓurtinaa, kisa ɗum wufta e wuuraare faade e <articleLink>worɓe e dañɓe</articleLink>. Ngaddinaaji e caltuɗe ŋakkooje e leeme keɓe eeltugol ena keewi yahdineede e dente yimɓe ɓurɓe joñeede e yeebeede. Kadi masiŋaaji keewi ena cugga e keftingol sawtooji rewɓe. Ko ɗuum waɗi amin cokli limlimtam e diiñorde keɓe sawto amen.

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
fuf: Mozilla Common Voice ko eɓɓoore ngam wallude masiŋaaji jaŋngude no yimɓe kaaldata jaati.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
fuf: Mozilla ena daranii ñiiɓnude geese ɗee e udditaanade mo woni kala. Ngam waɗde ɗuum, amin cokli doolnude sosiyaŋkooɓe geese rewde e eɓɓooje hono Common Voice. Sahaa mo karalle sawto ɓeydii heewde haa njalti jaaɓnirɗe dowrowe, amin ngongɗini eɗe poti nafde huutorɓe kala e mbaadi potal. Ɗuum firti ko waɗde doole e ɗemɗe kese kam e jaɓɓaade ngaddiinaaji kesi e leƴrenndooje tuma mahgol e ƴeewtagol karalle sawto. Common Voice ko jeyaande peñcu heɓotoonde mo woni kala etee goomuuji e topayɓe Mozilla wonɓe e jookli winndere ndee nana kuutoroo nde kam'en ne e eɓɓooje amen keeriiɗe.

source: Name
fuf: Innde

source: Native Language
fuf: Ɗemngal neeniwal

source: Need some help with accent?
fuf: Aɗa sokli ballal seeɗa baɗte ngaddin?

source: Need some help with variants?
fuf: Aɗa sokli ballal seeɗa e caltuɗe?

source: Next
fuf: Yeeso

source: Next Goals: { $goal }
fuf: Paandaale garooje: { $goal }

source: No
fuf: Alaa

source: No gravatar found for your email
fuf: Alaa gravatar yiytaanaa iimeel maa

source: No microphone found.
fuf: Alaa mikoroo yiytaa.

source: Northern Sotho
fuf: Sotho Soɓɓiire

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
fuf: Tesko: so waɗaama e 'Ena yiyoo', ngol teeltol ena waawi wayleede to <profileLink>Hello heftinirde</profileLink> toh

source: Note: You will still need to select between Speak or Listen to change contribution type.
fuf: Tesko: maa sokloy labaade hakkunde Haal walla Heɗo ngam waylude sifaa ballital.

source: No Thanks
fuf: Alaa, mi yaafiima

source: No variant selected
fuf: Alaa caltuka suɓaa

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
fuf: Tawde haŋkadi e ɓeydiima andude baɗte Common Voice, a etotaako jooni? Dobo e maandel mikkoroo ngel ngam fuɗɗaade tarde konnguɗi daande dow.<br/><br/>So ɓur-ɗaa hatojinde ko reftaade ballitte yimɓe woɗɓe, dobo e maandel tato ngel. Maa wallu teeŋtinde wonde nanngite ɗee ena njahdi e konnguɗi jaltuɗi e yahnirde.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
fuf: Aɗa waawi hokkirde sawto maa ngam wallude-min tafde diiñorde keɓe nde sewnde-udditiinde nde mo woni kala waawi huutoraade ngam waɗde jaaɓde kesamkeseme kuutorteeɗe e kaɓirdi kam e geese. Tar konngol ngam wallude masiŋaaji ekkaade no neɗɗo e jaati haaldata. Ƴeewto golle wallitoode woɗɓe ngam ƴellitde moƴƴugol. Ko noon wayi weeɓde!

source: Number of Voices
fuf: Limoore Sawtooji

source: Off
fuf: Ñifol

source: Offensive language
fuf: Ɗemngal nefningal

source: Offensive speech
fuf: Haala mbonka

source: On
fuf: Kuɓɓol

source: On desktop devices you can contribute by downloading…
fuf: E kaɓirɗe ordinateer aɗa waawi wallit-de ngaawtoɗaa…

source: On iOS please continue with Safari to enable recording…
fuf: E iOS tiiɗno jokku e Safari ngam waawnude nanngitogol…

source: Optionally join on our email list for updates and new information about the project.
fuf: So a welaama aɗa waawi yantude e doggol iimeeluuji amen ngam kesɗitine e kabaruuji kesi baɗte eɓɓoore ndee.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
fuf: Keɓe ɗe leƴrendiije mbaɗɗaaki naatneede (yeru: njogoram, ɗemngal, ngaddiin) mbaɗetaake e peñcu hay sahaa e heftinirde maa, kadi jokketaake e konte maa e leemre keɓe ndee. Lefon ojoo teelɗe maa njokkondire e keɓe leƴrendiije ngam moƴƴinde siko - yeru, biɗtoowo ena waawi toɓɓunde annorde eelto hucca e taƴannde leƴrendiire heeriinde.

source: Other
fuf: Goɗɗo

source: Other Language
fuf: Ɗemngal goɗngal

source: Other voice datasets…
fuf: Leeme keɓe sawto goɗɗe…

source: Other Voice Datasets
fuf: Leeme Keɓe Sawto Goɗɗe

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
fuf: Binndol sewde amen waɗiraa ko dokkanɗe asliije wallitooɓe kam e jeewte ummiiɗe e ciimte leppi sinimaa jeyi peñcu hono <italic>It’s a Wonderful Life</italic>. Aɗa waawi yiyde konnguɗi amen sewnde e ndee <githubLink>runngere</githubLink>.

source: Overall Accuracy
fuf: Ceeɓndam Kuuɓal

source: Overall Hr. Total
fuf: Waktuuji fof e kuuɓal

source: Overall project status: see how far we’ve come!
fuf: Ngonka eɓɓoore ndee e kuuɓal: ƴeew ɗo njetti-ɗen!

source: Partners
fuf: Gollidiiɓe

source: Personal dashboards keep you up-to-date with individual and community progress.
fuf: Tiimtorde heeriinde ena hollu maa ko ɓuri hesɗude e taabagol neɗɗo walla renndo fof.

source: <playIcon></playIcon>Last one!
fuf: <playIcon></playIcon>cakkitiiɗo oo!

source: Play/Stop
fuf: Tar/Dartin

source: Press play, listen & tell us: did they accurately speak the sentence below?
fuf: Ɓoɗɗu tarde, heɗaade e haalan-min: Ɗe kaalii koŋngol les ɗoo haa feewi?

source: Press { shortcut-play-toggle } to toggle play mode
fuf: Ñoƴƴu{ shortcut-play-toggle } ngam tolƴaade mbayka taro

source: Privacy
fuf: Suturo

source: Privacy Policy
fuf: Dawrugol Suturo

source: Profile
fuf: Heftinirde

source: Profile information improves the audio data used in training speech recognition accuracy.
fuf: Humpito heftinirde ina ƴellita keɓe ojoo kuutoraaɗe e peewgol heftinirde daande.

source: Progress
fuf: Taaɓagol

source: Read More
fuf: Jokku taro

source: Read more on our About page
fuf: Jokku taro to hello amen Ɓaɗte

source: Ready to add your voice or lend your ear?
fuf: A hebiima ɓeydude sawto maa walla luɓde nofru?

source: Ready to contribute?
fuf: Aɗa hebii wallitde?

source: Ready to donate your voice?
fuf: A hebiima rokkirde daande maa?

source: Ready to help validate sentences?
fuf: Aɗa hebii wallude moƴƴinde konnguɗi?

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
fuf: Heɓ iimeeluuji hono ciiftinooji ko fad-maa e faandaare maa, kesɗitine taaɓagol maa, e ɓatakeeji baɗte Common Voice.

source: Recorded Clips
fuf: Lefon Nanngitakon

source: Recorded Hours
fuf: Waktuuji nanngitaaɗi

source: <recordIcon></recordIcon> Last one!
fuf: <recordIcon></recordIcon> cakkitiiɗo oo!

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
fuf: Nanngitaade lefon sawto jeyaa tigi ko e mahde leemre keɓe amen udditiiɗe; won wiy-ɓe nih ko ɗoon ɓuri jirwude.

source: Record/Stop
fuf: Nanngito/Dartin

source: Record your voice
fuf: Nanngito daande maa

source: Remove
fuf: Momtu

source: Remove Avatar
fuf: ndernde

source: Report
fuf: Jaŋtol

source: Report was passed successfully
fuf: Jaŋtol neldiraama no haanirta!

source: Request a Language
fuf: Ɗaɓɓit Ɗemngal

source: *required
fuf: *ena waɗɗii

source: Re-record
fuf: Nanngito kadi

source: Re-record clip
fuf: Nanngito kadi lefel

source: Return
fuf: Rutto

source: Return here to edit your goal anytime.
fuf: Ruɗɗo ɗoo ngam taƴtaade faandaare maa nde njiɗ-ɗaa kala

source: Return to Common Voice
fuf: Rutto to Common Voice

source: Return to Common Voice Datasets
fuf: Rutto to Leeme Keɓe Common Voice

source: Return to Languages
fuf: Rutto to ɗemɗe

source: Review
fuf: Ƴeewto

source: Review & re-record clips here as you go
fuf: Ƴeewto & nanngito kadi lefon laawol gootol

source: Review & re-record clips if needed
fuf: Ƴeewto & nanngito kadi lefon so a soklii

source: Review & Submit
fuf: Ƴeewto & Neldu

source: Save
fuf: Danndu

source: Saved
fuf: Danndaama

source: Search
fuf: Yiylo

source: Search for answers
fuf: Yiylo jaabawuuji

source: See how your progress compares to other contributors all over the world.
fuf: Yiy hol no ɓeydagol maa yerondirta e ngol wallitooɓe e nder winndere ndee fof.

source: See Less
fuf: Yiy seeɗa

source: See More
fuf: Yiy goɗɗe

source: Select a Language...
fuf: Labo ɗemngal...

source: Send sign up link
fuf: Neldu jokkorde winndito

source: Sentences
fuf: Koŋnguɗi

source: Set a goal
fuf: Taƴ faandaare

source: Set my visibility
fuf: Taƴto jiyagol am

source: Settings
fuf: Teelte

source: Share Common Voice
fuf: Lollin Common Voice

source: Share my goal
fuf: Lollin faandaare am

source: Share your clip
fuf: Lollin lefel maa

source: Share your { $count } Clip Daily Goal for { $type }
fuf: Lollin Faandaare maa Lefon Ñalngu { $type }

source: Share your { $count } Clip Weekly Goal for { $type }
fuf: Lollin Faandaare maa Lefon Yontere{ $type }

source: Shortcuts
fuf: Codorɗe

source: Show my ranking
fuf: Hollu darnde am

source: Sign up for an account
fuf: Winndito ngam dañde konte

source: Sign up for Common Voice newsletters, goal reminders and progress updates
fuf: Winndito e ɓatakeeji Common Voice , ciiftine faandaare e kesɗitine beydagol.

source: sign up for email updates
fuf: Winndito ngam heɓde kesɗitine iimeel

source: Sign up for { $lang } updates:
fuf: Winndito ngam heɓde kesɗitine { $lang }:

source: Size
fuf: Ɓetol

source: Skip
fuf: Diw

source: Skip Submission Feedback
fuf: Diw duttinal naatnugol

source: Sorbian, Upper
fuf: Sorbian, Lower

source: Sorry, Common Voice is running slowly. Thanks for your interest.
fuf: Ɗaccu hakke, Common Voice ena leeli. A jaaraama e golle maa.

source: Sorry, something went wrong
fuf: Ɗaccu hakke, won ko feewaani

source: Southern Sotho
fuf: Sotho Ɓaleeri

source: Speak
fuf: Haal

source: Speakers
fuf: Haalooɓe

source: Speaking
fuf: Kaalgol

source: Speaking and Listening
fuf: Kaalgol e Keɗogol

source: Speak in your normal voice! The way you speak is welcome here - we want your accent as it is, and we want your usual volume, style and intonation.
fuf: Haaldu no keew-ɗaa haaldude nih. No kaaldataa nih ena hatojinaa ɗoo - min njiɗi ko kaaldaa ngaddin maa oo siforii nih, kadi hito maa, daande e no kaaldataa tawa waylaaki.

source: Speak now
fuf: Haal jooni

source: Speak up, contribute here!
fuf: Ɓamtu daande, wallit ɗoo!

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
fuf: <speechBlogLink>Fuɗɗoro ɗoo Keftingol Haala</speechBlogLink>

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
fuf: Haala woni ko ɓuri tagoɗinde e no jokkondirirten hakkunde men etee maa karalle sawto ɗee ngaddu ɗeen baawtine e ordinateeruuji men e kaɓirɗi cinnde men. Min njiɗi ko doolnude topayɓe yoo mah jaaɓnirɗe keftinirɗe sawto moolanaaɗe wono pirooje e saasi e keedooje ɓeydaaɗe sawto. Kono oo sahaa ko ɓuri heewde e keɓe coklaaɗe ngam mahde hono ɗeen jaaɓɗe ena tiiɗi kadi ko jeyaaɗe. Amin ɗaminii leemre keɓe Common Voice ndee maa hokku topayɓe ko ɓe cokli ngam kesamhesnude e waɗde karalle haala heɓaade e ɗemɗe maɓɓe keeriiɗe. Ngam waɗde keftingol sawto winnderewol, amin ndoɓindoo juɓɓanɗe e ɗemɗe ɓurɗe haaleede ɗee kam e ɓurɗe famɗude renndo haalooɓe ɗe nganndu-ɗaa ena keewi ko ɗawaa e carwe keftingol haala julorteeɗe ɗee. Bayyinde leemre keɓe sawto limtoɗinnde maa doolnu topayɓe, yeñcinamgolle en, e renndooji haala kuuɓɗi ngam ñawndude ɗeen ŋakke kamɓe e koye maɓɓe.

source: Speech-to-text (STT)
fuf: Haala-to-binndol (Speech to Text, STT)

source: Speech-to-text (STT) technologies convert voice data into text.
fuf: Karalle haala-to-binndol (STT) ƴettat sawto waɗta ɗum binndol.

source: Splits
fuf: Keltine

source: Start recording
fuf: Fuɗɗo nanngitogol

source: Start typing to describe your accent
fuf: Fuɗɗo tappude ngam sifaade ngaddin maa

source: Stats
fuf: Limte

source: Status Page
fuf: Hello Ngonka

source: Streaks
fuf: Sahngaaji ittuɗi

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
fuf: <strong>Hoto riiwtu hito ɗo kaaloowo oo ‘ena jogii ngaddin’ mo jiidaani e mo mah</strong> - Ɗuum eba teeŋti sanne ngam Heftingol Hito ena waawa yuɓɓande mo woni kala.

source: Submit
fuf: Naatnu

source: Submit a report
fuf: Naatnu Jaŋtol

source: Submit clips
fuf: Naatnu lefon

source: Subscribe
fuf: Lulno

source: Success
fuf: Moƴƴii

source: Success, profile created!
fuf: Moƴƴii, heftinirde sosaama!

source: Tap
fuf: Tappu

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
fuf: Tatoeba ko diiñorde keɓe konnguɗi, firooji e ojoo gowlaaɗo mawnde ngam huutoraade e jaŋde ɗemɗe. Ngol gaawtol ena jogii Engleleere wowlaande nanngitaande renndo ngoo.

source: Terms
fuf: Sarɗiiji

source: Thanks for confirming your account, now let's build your profile.
fuf: A jaaraama e teeŋtingol konte maa, jooni noon mahen heftinirde maa.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
fuf: Alla e ballitte ko ɓuri 259k neɗɗo e ko ɓuri ɗemɗe 50, ɗee keɓe nana kuutoree ngam eeltude jaaɓnirɗe ɓeydaaɗe-haala yoo ɓyr waawde faamde daande neɗɗaŋke.

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
fuf: A jaaraama e nanngitagol!<lineBreak></lineBreak>Jooni ƴeewto kisa naatnaa lefon maa les ɗoo.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
fuf: A jaaraama e katojinal maa e addude balle e { $lang }. Amina ngolla tiiɗɗe ngam heɓlude ɗemngal kala ngam waawa fuɗɗaade kadi jokkude humpitde guumuuji huutoraade iimeel. So aɗa yiɗi wallitde, tiiɗno hokku iimeel maa les ɗoo.

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
fuf: Genaale Lefon ɗee ko lefon sawto koriiɗe ɓennude to leemre keɓe Common Voice ndee. Hono leemre keɓe ndee nih, Genaale Lefon ɗee ena waawi aawteede.

source: The clip has disrespectful or offensive language.
fuf: Lefel ngell ena waɗi haala nehtorka walla mbonka.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
fuf: Leemre keɓe Common Voice timminta musiŋ keftinirɗo sawto sewnde-udditiinde mo Mozilla hono Deep Speech. Yamre Deep Speech adannde bayyinanoo ko e Yarkomaa 2017 kadi nana jokki e ƴelliteede gila ndeen. Kañum e leemre keɓe Common Voice, amin ngoongɗiɗi ɗee karalle keftinirgol sawto udditiiɗe ena poti heɓaade e mo woni kala. Ko ɗaminaare amen wonde ɗee karalle maa mballu topayɓe mahde haralde jaaɓnirɗe e carwe kesamhesamiiɗe.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
fuf: Leemre Keɓe Common Voice ndee ena waɗi teemedde ujunnaaje jubbanɗe sawto ballooje topayɓe mahde kutorɗe keftinooje sawto.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
fuf: Leemre keɓe Common Voice ndee ko jeyaande udditiinde heɓotoonde e peñcu waawnde huutoreede ngam eeltude jaaɓɗe ɓeydaaɗe haala ɗe fannuuji jaajɗe limtoɗinɗe. Ngam reende kisal wallitooɓe amen, min naamnoto mo woni kala gaawtotooɗo Leemre keɓe Common Voice ndee yoo hormo suturo wallitooɓe ɓee. Lefon sawto ngonkon e leemre keɓe kon fof ko momtaaɗe kala humpito waawngo heftine neɗɗo. So aɗa aawtoo Leemre keɓe ndee, a jaɓat waasde etaade anndude neɗɗo ballitoowo oo. Ɗuum firti ko a waawaa etaade jokkondirde humpito Leemre keɓe ndee e humpito heeraniingo ballitoowo oo. Aɗa waawi noon, huutoraade Leemre keɓe ndee ngam eeltude keftinirgol haala, keftingol kaaloowo, walla jaaɓnirɗe goɗɗe, so, yeru jokkondirde humpito wonngo e Leemre keɓe ndee e humpito woɗngo tawaango e Leemre keɓe ndee.

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
fuf: Leemre keɓe Common Voice ndee ena heɓoo e gaawtol fawaade e jamirol <licenseLink>CC</licenseLink> to <datasetLink>Hello amen Leemre Keɓe</datasetLink>. Aɗa waawi kadi aawtaade leeme keɓe goɗɗe gonɗe e peñcu e ngoon hello.

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
fuf: Limoore waktuuji nanngitagol sawto jaalɗinangol huutorɓe 2 e nder 3 tawa ko daande “Eey”. Ɗii maantotoo taaɓal huccande happo waktuuji 10K eɓɓoore ndee e kuuɓal.

source: The count of voice recording hours we have collected so far.
fuf: Ɗum ɗoo ko limoore waktuuji sawtooji doɓindaaɗi tawo.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
fuf: Faandaare leemre keɓe Common Voice ndee ko wallude mo woni kala e winndere ndee mahde keɓtinirgol haala, kaaloowo walla fannu jaaɓnirɗe kala naamniingu keɓe sawto. Heedorde sawto ko geɗel tan e fannuuji jaaɓnirɗe keewɗe baawɗe huutoraade leemre kece ndee.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
fuf: Yamre limtiɗemɗiire leemre keɓe Common Voice woni oo sahaa ko e mahngo e suɓto. So aɗa yiɗi wallude min naatnude Common Voice e ɗemɗe kese, yah ƴeewoy kuutorgal <sentenceCollectorLink>Roɓindorde Konnguɗi</sentenceCollectorLink> ngam ɓeydude konnguɗi kesi e leemre keɓe ndee, e <pontoonLink>Pontoon</pontoonLink> mo Mozilla ngam firde lowre ndee e jaati. Ɗemɗe kese ɓeydete e Common Voice ngam wallitde so konnguɗi 5000 jaɓaaɗi keɓaama.

source: The number of recordings and which languages you contribute to will be public.
fuf: Nanngitte ɗee no poti e ɗemɗe ɗe mballittaa maa ngon e peñcu.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
fuf: Ko niɓɓiɗingol humpito heftinirde kuutoro waasa jeyeede e lefon sawto ndokkakon so ɗe kaɓɓaama ngam aawtodeede e leemre keɓe ndee.

source: The recording was too long.
fuf: Nanngitogol ngol ina juuti no feewi.

source: The recording was too quiet.
fuf: Nanngitogol ngol deeƴii no feewi.

source: The recording was too short.
fuf: Nanngitogol ngol ina raɓɓiɗi no feewi.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
fuf: Ɗee-ɗoo ɗemɗe ngoni oo sahaa ko e topayru. Pale taaɓagol ɗee kollirta ko hol to ɗemngal kala yahrata e fannu <localizationGlossaryLink>nokkuɗinal lowre</localizationGlossaryLink> kam e <sentenceCollectionGlossaryLink>roɓindagol konnguɗi</sentenceCollectionGlossaryLink>.

source: The selected file is too large
fuf: Fiilde suɓaande ndee ina mawni no feewi

source: The sentence has a grammatical or spelling error.
fuf: Konngol ngol ena waɗi juumre celluka walla mbinndiin.
